{
  "irVersion": "1.0",
  "project": "phoenix-go",
  "repository": "https://github.com/plexusone/phoenix-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone and repo rename from go-phoenix to phoenix-go" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/agentplexus/go-phoenix` to `github.com/plexusone/phoenix-go`", "commit": "6ee520a" }
      ],
      "dependencies": [
        { "description": "Upgraded `github.com/plexusone/omniobserve` from v0.5.0 to v0.7.0", "commit": "6ee520a" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2026-01-17",
      "changed": [
        { "description": "Updated Go module dependencies", "commit": "aacc260" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-04",
      "added": [
        { "description": "OpenTelemetry integration (`otel` package) with OTLP HTTP exporter", "commit": "bcd0e2f" },
        { "description": "Phoenix Cloud support via `PHOENIX_API_KEY` and `PHOENIX_SPACE_ID` environment variables", "commit": "bcd0e2f" },
        { "description": "OpenInference semantic conventions for LLM observability attributes", "commit": "bcd0e2f" },
        { "description": "Batch and sync span processing modes", "commit": "bcd0e2f" },
        { "description": "REST API client for Projects, Spans, Datasets, Experiments, Prompts, Annotations", "commit": "bcd0e2f" },
        { "description": "Evaluation framework (`evals` package) for running metrics on LLM outputs", "commit": "bcd0e2f" },
        { "description": "omniobserve/llmops Provider implementation for unified observability interface", "commit": "bcd0e2f" },
        { "description": "OpenInference span kinds: LLM, Chain, Tool, Agent, Retriever, Embedding, Reranker, Guardrail", "commit": "bcd0e2f" },
        { "description": "Prompt versioning and tagging support", "commit": "bcd0e2f" },
        { "description": "Span and trace-level annotations", "commit": "bcd0e2f" },
        { "description": "Integration tests for Phoenix Cloud", "commit": "bcd0e2f" }
      ],
      "fixed": [
        { "description": "Handle zero duration on Windows in tests", "commit": "6a9b04a" }
      ]
    }
  ]
}
